In [47]:
import pandas as pd
import numpy as np

data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(data, index=labels)

"""
Write a function that takes dataframe df (defined above) and string with animal as inputs and returns rows where animal is equal to string (parameter function) and age is less than 3.

Notes:
        - Return empty DataFrame if wrong animal is written
"""

def filter_animals(df, animal):
    if animal in set(df['animal'].tolist()):
        print(df.loc[(df['animal'] == animal) & (df['age'] < 3.)])
    else:
        not_found = pd.DataFrame()
        print(not_found)

In [2]:
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [48]:
filter_animals(df, 'cat')

  animal  age  visits priority
a    cat  2.5       1      yes
f    cat  2.0       3       no

In [20]:
'dog' in set(df['animal'].tolist())

True

In [163]:
import pandas as pd
import numpy as np

data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(data, index=labels)

"""
Write a function that takes dataframe df (defined above) as input and returns filtered dataframe with:
        - Only numeric columns
        - Only rows without any missing values

Notes:
        - Don’t select the columns and rows manually (use filtering)
"""

def filter_dataframe(df):
    num_cols = df.dtypes[df.dtypes != object].index.tolist()
    df_all = df.dropna()
    return(df_all[num_cols])

In [161]:
filter_dataframe(df)

    Age  Rating
0    25    4.23
1    26    3.24
2    25    3.98
3    23    2.56
4    30    3.20
5    29    4.60
6    23    3.80
7    34    3.78
8    40    2.98
9    30    4.80
10   51    4.10
11   46    3.65

In [222]:
import pandas as pd
import numpy as np

#Create a Dictionary of series
d = {'Name':pd.Series(['Andres','James','David','Vin','Steve','David','Jack',
   'Lee','David','Gasper','Betina','Andres']),
   'Age':pd.Series([25,26,25,23,30,29,23,34,40,30,51,46]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8,3.78,2.98,4.80,4.10,3.65])
}

#Create a DataFrame
df = pd.DataFrame(d)

"""
Write a function that takes df (defined above) as input and returns tuple with 3 values:
   - Most common name (string)
   - Average age (float)
   - IQR of rating (float)

Notes:
   - Average age and IQR must be float not numpy.float64 type
"""


def compute_statistics(df):
    name_mode = df['Name'].mode()[0]
    age_mean = float(df['Age'].mean())
    
    q75, q25 = np.percentile(df['Rating'], [75 ,25])
    rating_iqr = float(q75 - q25)
    
    return((name_mode, age_mean, rating_iqr))

In [215]:
compute_statistics(df)

('David', 31.833333333333332, 0.9024999999999999)

In [183]:
df

      Name  Age  Rating
0   Andres   25    4.23
1    James   26    3.24
2    David   25    3.98
3      Vin   23    2.56
4    Steve   30    3.20
5    David   29    4.60
6     Jack   23    3.80
7      Lee   34    3.78
8    David   40    2.98
9   Gasper   30    4.80
10  Betina   51    4.10
11  Andres   46    3.65

In [213]:
df['Name'].mode()[0]

'David'

In [219]:
float(df['Age'].mean())

31.833333333333332

In [221]:
q75, q25 = np.percentile(df['Rating'], [75 ,25])
iqr = q75 - q25
iqr

0.9024999999999999

In [ ]:
"""
 - Connect to the hr.db (stored in supporting-files directory) with sqlite3 
 - Write a query to find the names (first_name, last_name) of the employees who have a manager who works for a department based in the United States. 
 

Expected columns:
    - first_name	
    - last_name	
    - manager_od

Notes:
    - Use tables employees, departments and locations
    - You shouldn’t use JOINs here. 
    - You can connect to DB from Jupyter Lab/Notebook, explore the table and try different queries
    - In the variable 'SQL' store only the final query ready for validation 
"""


SQL = """
SELECT first_name, last_name, manager_id
    FROM employees
    WHERE manager_id in (SELECT manager_id
                            FROM employees
                            WHERE department_id in (SELECT department_id
                                                        FROM departments
                                                        WHERE location_id in (SELECT location_id
                                                                                FROM locations
                                                                                WHERE country_id in (SELECT country_id
                                                                                                        FROM countries
                                                                                                        WHERE country_name is 'United States of America'))))"""

In [ ]:
"""
 - Connect to the hr.db (stored in supporting-files directory) with sqlite3 
 - Write a query to get the difference (salary_span) between min and max salary for each job ID excluding programmer (job_id = 9) and sort it, starting with the highest salary_span.



Expected columns:
    - job_id	
    - salary_span

Notes:
    - Use employees table
    - You can connect to DB from Jupyter Lab/Notebook, explore the table and try different queries
    - In the variable 'SQL' store only the final query ready for validation 
"""


SQL = """
SELECT job_id, max(salary)-min(salary) as salary_span FROM employees
WHERE job_id != 9
GROUP BY job_id
ORDER BY salary_span DESC"""